#define _CRT_SECURE_NO_WARNINGS 1


#include<stdio.h>

//操作符分类
/*
* 算术操作符、移位操作符、位操作符、赋值操作符
* 单目操作符、关系操作符、逻辑操作符、条件操作符
* 逗号表达式、下标引用、函数调用和结构成员操作符
*/


//整数的二进制表示形式有3种
//原反补
//正整数：原反补相同
//负整数：需要计算的
//例子
//5
//00000000000000000000000000000101：原反补都是它
//最高位为0表示为正数

//-5
//10000000000000000000000000000101：原码
//11111111111111111111111111111010：反码
//11111111111111111111111111111011：补码
//原码的符号位不变，其它位按位取反就是反码
//反码加1就是补码


//整数在内存中存储的是二进制的补码

#if 0
int main() {
	int a = 5;
	int b = a << 1;

	printf("%d\n", a);
	//00000000000000000000000000000101
	//左移一位，右边补0
	//00000000000000000000000000001010
	//符号位依旧是0，所以原反补相同，所以直接拿出来，就是10
	printf("%d\n", b);

	return 0;
}
#endif

//左移：左边丢弃右边补0
//补码得原码有两个方法：
//第一个：原路返回
//第二个：继续符号位不变取反，+1也可以得到原码
#if 0
int main() {
	int a = -5;
	int b = a << 1;
	//10000000000000000000000000000101-原
	//存的是补码
	//11111111111111111111111111111011-补
	//左移
	//11111111111111111111111111110110-补(移后)
	//11111111111111111111111111110101-反(移后)
	//10000000000000000000000000001010-原(移后)
	printf("%d\n", a);
	printf("%d\n", b);
	return 0;
}
#endif


//右移
#if 0
int main() {
	int a = -5;
	//10000000000000000000000000000101-原
	//11111111111111111111111111111010-反
	//11111111111111111111111111111011-补
	//右移
	//11111111111111111111111111111101-补
	//11111111111111111111111111111100-反
	//10000000000000000000000000000011-原
	int b = a >> 1;//当前编译器是个算数右移

	printf("%d\n", a);
	printf("%d\n", b);

	return 0;
}
#endif
//右移操作符
//算数右移：右边丢弃，左边补原符号位
//逻辑右移：右边丢弃，左边补0
//取决于编译器


//不要尝试移动负数位，是标准为定义的行为
//如：
#if 0
num >> -1;//err
#endif



//&-按位与
//|-按位或
//^-按位异或-不同为1，相同为0
int main() {
	int a = 3;
	int b = -5;
	//0000000000000000000000000000011-3的补码
	//1111111111111111111111111111011--5的补码
	int c = a & b;//3
	//0000000000000000000000000000011-原反补
	int d = a | b;//-5
	//1111111111111111111111111111011-补
	//1111111111111111111111111111010
	//1000000000000000000000000000101-（-5）
	int e = a ^ b;//-8
	//1111111111111111111111111111000
	//1111111111111111111111111110111
	//1000000000000000000000000001000
	printf("%d %d %d", c, d, e);

	return 0;
}


//0和任何数字异或还是它自己
//a^a=0
//0^a=a
//应用，找出只出现一次的数字